### Лабораторная работа. Базовая настройка коммутатора

![](https://github.com/Adminkzn/Otus-Network-Engineer/blob/107e05e07fadad109b5df13bd89fd537c581f3ab/img/lab%201-1.jpg?raw=true)


#### Задачи
##### Часть 1. Проверка конфигурации коммутатора по умолчанию
##### Часть 2. Создание сети и настройка основных параметров устройстваЧасть 2. Создание сети и настройка основных параметров устройства
•	Настройте базовые параметры коммутатора.
•	Настройте IP-адрес для ПК.
##### Часть 3. Проверка сетевых подключенийЧасть 3. Проверка сетевых подключений
•	Отобразите конфигурацию устройства.
•	Протестируйте сквозное соединение, отправив эхо-запрос.
•	Протестируйте возможности удаленного управления с помощью Telnet.

